lsoldano93/ECSE426/Lab3_STM32F4Cube_Base_project/Sources/main.c
/**
  ******************************************************************************
  * File Name          : main.c
  * Description        : Main program subroutine
	* Author						 : Ashraf Suyyagh
	* Version            : 1.0.0
	* Date							 : January 14th, 2016
  ******************************************************************************
  */
	
/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"
#include "supporting_functions.h"
#include "lis3dsh.h"
#include "sys_config.h"
#include "accelerometer.h"
#include "7_segment.h"
#include "global_vars.h"
#include "gpio_config.h"
#include "keypad.h"


/* Private variables ---------------------------------------------------------*/

//array of size 3 that contains the accelerometer output
float accelerometer_out[3];

//interupt for accelerometer
//uint8_t ready_to_update_accelerometer = 0;

/* @brief Structure for the Kalman filter  */ 
typedef struct kalman_t{
	float q;
	float r;
	float x;
	float p;
	float k;
} kalman_t;

/* Private function prototypes -----------------------------------------------*/
void init_interrupts(); //TODO
void SystemClock_Config	(void); //TODO

/**  Assembly Kalmann filter function
   * @brief  Filters values to remove noisy fluctuations
	 * @param  Input value of measurements, array to output to, length of arrays, and kalman parameter struct
   * @retval Returns updated output array **/
int Kalmanfilter_asm(float* inputArray, float* outputArray, int arrayLength, kalman_t* kalman);

/* Private functions ---------------------------------------------------------*/

void init_TIM3(void) {
	TIM_Base_InitTypeDef init_TIM;
	TIM_HandleTypeDef handle_tim;
	// Clock Rate = ClockFrequency / (prescaler * period)
	// need to setup period and prescaler
	init_TIM.Period = 100;
	init_TIM.Prescaler = 100;
	init_TIM.ClockDivision = TIM_CLOCKDIVISION_DIV1;
	init_TIM.CounterMode = TIM_COUNTERMODE_UP;
	
	handle_tim.Instance = TIM3;
	handle_tim.Init = TIM_TimeBaseStructure;
	handle_tim.Channel = HAL_TIM_ACTIVE_CHANNEL_CLEARED;
	handle_tim.Lock = HAL_UNLOCKED;
	handle_tim.State = HAL_TIM_STATE_READY;

	HAL_TIM_Base_MspInit(&handle_tim);
	
	// enable clock for TIM3 
	__TIM3_CLK_ENABLE();
	
	HAL_TIM_Base_Init(&handle_tim);
	HAL_TIM_Base_Start_IT(&handle_tim);
		
	/* Configure NVIC */
	HAL_NVIC_EnableIRQ(TIM3_IRQn);
	HAL_NVIC_SetPriority(TIM3_IRQn, 0,0);
	//HAL_NVIC_ClearPendingIRQ(TIM3_IRQn);
}


int main(void){	
  
	/* MCU Configuration----------------------------------------------------------*/
  HAL_Init();

  /* Configure the system clock */
  SystemClock_Config();
	
  /* Initialize all configured peripherals */
	
	init_accelerometer(); //initialize accelerometer
	gpio_init();
//	__HAL_GPIO_EXTI_GENERATE_SWIT(EXTI0_IRQn); //create software interrupt
	
	ready_to_update_accelerometer = 0; //set accelerometer initally to 0

	printf("Start");
	//run when interrupt received
	while (1){
		
		if(ready_to_update_accelerometer == 1) {
			
			LIS3DSH_ReadACC(accelerometer_out);
			
			//reset interrupt
			printf("flag set\n");
			ready_to_update_accelerometer = 0;
			
			//update real accelerometer values
			update_accel_values(accelerometer_out[0], accelerometer_out[1], accelerometer_out[2]);
			
			printf("Tilt: %f, Rotation: %f\n", fabs(calc_pitch_angle()), fabs(calc_roll_angle()));
			
		}
	}
	
	return 0;
}
void HAL_GPIO_EXTI_Callback(uint16_t GPIO_Pin) {
	
	/* Prevent unused argument(s) compilation warning */
  __IO uint32_t tmpreg = 0x00;
  UNUSED(tmpreg); 
	
	if(GPIO_Pin == GPIO_PIN_0) {
		LIS3DSH_ReadACC(accelerometer_out);
	}	
}	

/** System Clock Configuration*/
void SystemClock_Config(void){

  RCC_OscInitTypeDef RCC_OscInitStruct;
  RCC_ClkInitTypeDef RCC_ClkInitStruct;

  __PWR_CLK_ENABLE();

  __HAL_PWR_VOLTAGESCALING_CONFIG(PWR_REGULATOR_VOLTAGE_SCALE1);

  RCC_OscInitStruct.OscillatorType 	= RCC_OSCILLATORTYPE_HSE;
  RCC_OscInitStruct.HSEState 			 	= RCC_HSE_ON;
  RCC_OscInitStruct.PLL.PLLState 		= RCC_PLL_ON;
  RCC_OscInitStruct.PLL.PLLSource 	= RCC_PLLSOURCE_HSE;
  RCC_OscInitStruct.PLL.PLLM 				= 8;
  RCC_OscInitStruct.PLL.PLLN 				= 336;
  RCC_OscInitStruct.PLL.PLLP 				= RCC_PLLP_DIV2;
  RCC_OscInitStruct.PLL.PLLQ 				= 7;
  if (HAL_RCC_OscConfig(&RCC_OscInitStruct) != HAL_OK){Error_Handler(RCC_CONFIG_FAIL);};

  RCC_ClkInitStruct.ClockType 			= RCC_CLOCKTYPE_SYSCLK|RCC_CLOCKTYPE_PCLK1|RCC_CLOCKTYPE_PCLK2;
  RCC_ClkInitStruct.SYSCLKSource 		= RCC_SYSCLKSOURCE_PLLCLK;
  RCC_ClkInitStruct.AHBCLKDivider 	= RCC_SYSCLK_DIV1;
  RCC_ClkInitStruct.APB1CLKDivider 	= RCC_HCLK_DIV4;
  RCC_ClkInitStruct.APB2CLKDivider 	= RCC_HCLK_DIV2;
  if (HAL_RCC_ClockConfig(&RCC_ClkInitStruct, FLASH_LATENCY_5)!= HAL_OK){Error_Handler(RCC_CONFIG_FAIL);};
	
	/*Configures SysTick to provide 1ms interval interrupts. SysTick is already 
	  configured inside HAL_Init, I don't kow why the CubeMX generates this call again*/
  HAL_SYSTICK_Config(HAL_RCC_GetHCLKFreq()/1000);

	/* This function sets the source clock for the internal SysTick Timer to be the maximum,
	   in our case, HCLK is now 168MHz*/
  HAL_SYSTICK_CLKSourceConfig(SYSTICK_CLKSOURCE_HCLK);

  /* SysTick_IRQn interrupt configuration */
  HAL_NVIC_SetPriority(SysTick_IRQn, 0, 0);
}

#ifdef USE_FULL_ASSERT

/**
   * @brief Reports the name of the source file and the source line number
   * where the assert_param error has occurred.
   * @param file: pointer to the source file name
   * @param line: assert_param error line source number
   * @retval None
   */
void assert_failed(uint8_t* file, uint32_t line){
}
#endif

